docs/evidence/perf/sweep-threads-100.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m06.0s), 05/55 VUs, 20 complete and 0 interrupted iterations
warmup    [   4% ] 5 VUs    00.7s/20s
measure • [   0% ] waiting  24.3s

running (0m07.0s), 05/55 VUs, 60 complete and 0 interrupted iterations
warmup    [   9% ] 5 VUs    01.7s/20s
measure • [   0% ] waiting  23.3s

running (0m08.0s), 05/55 VUs, 100 complete and 0 interrupted iterations
warmup    [  14% ] 5 VUs    02.7s/20s
measure • [   0% ] waiting  22.3s

running (0m09.0s), 05/55 VUs, 137 complete and 0 interrupted iterations
warmup    [  19% ] 5 VUs    03.7s/20s
measure • [   0% ] waiting  21.3s

running (0m10.0s), 05/55 VUs, 180 complete and 0 interrupted iterations
warmup    [  24% ] 5 VUs    04.7s/20s
measure • [   0% ] waiting  20.3s

running (0m11.0s), 05/55 VUs, 220 complete and 0 interrupted iterations
warmup    [  29% ] 5 VUs    05.7s/20s
measure • [   0% ] waiting  19.3s

running (0m12.0s), 05/55 VUs, 265 complete and 0 interrupted iterations
warmup    [  34% ] 5 VUs    06.7s/20s
measure • [   0% ] waiting  18.3s

running (0m13.0s), 05/55 VUs, 305 complete and 0 interrupted iterations
warmup    [  39% ] 5 VUs    07.7s/20s
measure • [   0% ] waiting  17.3s

running (0m14.0s), 05/55 VUs, 349 complete and 0 interrupted iterations
warmup    [  44% ] 5 VUs    08.7s/20s
measure • [   0% ] waiting  16.3s

running (0m15.0s), 05/55 VUs, 390 complete and 0 interrupted iterations
warmup    [  49% ] 5 VUs    09.7s/20s
measure • [   0% ] waiting  15.3s

running (0m16.0s), 05/55 VUs, 435 complete and 0 interrupted iterations
warmup    [  54% ] 5 VUs    10.7s/20s
measure • [   0% ] waiting  14.3s

running (0m17.0s), 05/55 VUs, 475 complete and 0 interrupted iterations
warmup    [  59% ] 5 VUs    11.7s/20s
measure • [   0% ] waiting  13.3s

running (0m18.0s), 05/55 VUs, 520 complete and 0 interrupted iterations
warmup    [  64% ] 5 VUs    12.7s/20s
measure • [   0% ] waiting  12.3s

running (0m19.0s), 05/55 VUs, 560 complete and 0 interrupted iterations
warmup    [  69% ] 5 VUs    13.7s/20s
measure • [   0% ] waiting  11.3s

running (0m20.0s), 05/55 VUs, 605 complete and 0 interrupted iterations
warmup    [  74% ] 5 VUs    14.7s/20s
measure • [   0% ] waiting  10.3s

running (0m21.0s), 05/55 VUs, 630 complete and 0 interrupted iterations
warmup    [  79% ] 5 VUs    15.7s/20s
measure • [   0% ] waiting  09.3s

running (0m22.0s), 05/55 VUs, 670 complete and 0 interrupted iterations
warmup    [  84% ] 5 VUs    16.7s/20s
measure • [   0% ] waiting  08.3s

running (0m23.0s), 05/55 VUs, 715 complete and 0 interrupted iterations
warmup    [  89% ] 5 VUs    17.7s/20s
measure • [   0% ] waiting  07.3s

running (0m24.0s), 05/55 VUs, 760 complete and 0 interrupted iterations
warmup    [  94% ] 5 VUs    18.7s/20s
measure • [   0% ] waiting  06.3s

running (0m25.0s), 05/55 VUs, 804 complete and 0 interrupted iterations
warmup    [  99% ] 5 VUs    19.7s/20s
measure • [   0% ] waiting  05.3s

running (0m26.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.3s

running (0m27.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.3s

running (0m28.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.3s

running (0m29.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.3s

running (0m30.0s), 00/55 VUs, 820 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.3s

running (0m31.0s), 50/55 VUs, 1070 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   2% ] 50 VUs  00.7s/45s

running (0m32.0s), 50/55 VUs, 1545 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   4% ] 50 VUs  01.7s/45s

running (0m33.0s), 50/55 VUs, 1983 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   6% ] 50 VUs  02.7s/45s

running (0m34.0s), 50/55 VUs, 2451 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   8% ] 50 VUs  03.7s/45s

running (0m35.0s), 50/55 VUs, 2939 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  11% ] 50 VUs  04.7s/45s

running (0m36.0s), 50/55 VUs, 3403 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  13% ] 50 VUs  05.7s/45s

running (0m37.0s), 50/55 VUs, 3883 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  15% ] 50 VUs  06.7s/45s

running (0m38.0s), 50/55 VUs, 4356 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  17% ] 50 VUs  07.7s/45s

running (0m39.0s), 50/55 VUs, 4833 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  19% ] 50 VUs  08.7s/45s

running (0m40.0s), 50/55 VUs, 5303 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  22% ] 50 VUs  09.7s/45s

running (0m41.0s), 50/55 VUs, 5783 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  24% ] 50 VUs  10.7s/45s

running (0m42.0s), 50/55 VUs, 6242 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  26% ] 50 VUs  11.7s/45s

running (0m43.0s), 50/55 VUs, 6733 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  28% ] 50 VUs  12.7s/45s

running (0m44.0s), 50/55 VUs, 7183 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  31% ] 50 VUs  13.7s/45s

running (0m45.0s), 50/55 VUs, 7669 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  33% ] 50 VUs  14.7s/45s

running (0m46.0s), 50/55 VUs, 8112 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  35% ] 50 VUs  15.7s/45s

running (0m47.0s), 50/55 VUs, 8583 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  37% ] 50 VUs  16.7s/45s

running (0m48.0s), 50/55 VUs, 9033 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  39% ] 50 VUs  17.7s/45s

running (0m49.0s), 50/55 VUs, 9517 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  42% ] 50 VUs  18.7s/45s

running (0m50.0s), 50/55 VUs, 9983 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  44% ] 50 VUs  19.7s/45s

running (0m51.0s), 50/55 VUs, 10433 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  46% ] 50 VUs  20.7s/45s

running (0m52.0s), 50/55 VUs, 10883 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  48% ] 50 VUs  21.7s/45s

running (0m53.0s), 50/55 VUs, 11374 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  51% ] 50 VUs  22.7s/45s

running (0m54.0s), 50/55 VUs, 11833 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  53% ] 50 VUs  23.7s/45s

running (0m55.0s), 50/55 VUs, 12283 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  55% ] 50 VUs  24.7s/45s

running (0m56.0s), 50/55 VUs, 12733 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  57% ] 50 VUs  25.7s/45s

running (0m57.0s), 50/55 VUs, 13199 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  59% ] 50 VUs  26.7s/45s

running (0m58.0s), 50/55 VUs, 13649 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  62% ] 50 VUs  27.7s/45s

running (0m59.0s), 50/55 VUs, 13748 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  64% ] 50 VUs  28.7s/45s

running (1m00.0s), 50/55 VUs, 14202 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  66% ] 50 VUs  29.7s/45s

running (1m01.0s), 50/55 VUs, 14675 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  68% ] 50 VUs  30.7s/45s

running (1m02.0s), 50/55 VUs, 15148 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  71% ] 50 VUs  31.7s/45s

running (1m03.0s), 50/55 VUs, 15599 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  73% ] 50 VUs  32.7s/45s

running (1m04.0s), 50/55 VUs, 16049 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  75% ] 50 VUs  33.7s/45s

running (1m05.0s), 50/55 VUs, 16548 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  77% ] 50 VUs  34.7s/45s

running (1m06.0s), 50/55 VUs, 16998 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  79% ] 50 VUs  35.7s/45s

running (1m07.0s), 50/55 VUs, 17457 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  82% ] 50 VUs  36.7s/45s

running (1m08.0s), 50/55 VUs, 17948 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  84% ] 50 VUs  37.7s/45s

running (1m09.0s), 50/55 VUs, 18398 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  86% ] 50 VUs  38.7s/45s

running (1m10.0s), 50/55 VUs, 18898 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  88% ] 50 VUs  39.7s/45s

running (1m11.0s), 50/55 VUs, 19348 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  91% ] 50 VUs  40.7s/45s

running (1m12.0s), 50/55 VUs, 19798 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  93% ] 50 VUs  41.7s/45s

running (1m13.0s), 50/55 VUs, 20248 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  95% ] 50 VUs  42.7s/45s

running (1m14.0s), 50/55 VUs, 20648 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  97% ] 50 VUs  43.7s/45s

running (1m15.0s), 50/55 VUs, 20935 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  99% ] 50 VUs  44.7s/45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=4.72ms

    http_req_failed{phase:measure}
    ✓ 'rate<0.01' rate=0.68%


  █ TOTAL RESULTS 

    checks_total.......: 168832  2240.340192/s
    checks_succeeded...: 100.00% 168832 out of 168832
    checks_failed......: 0.00%   0 out of 168832

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✓ order 처리됨

    CUSTOM
    resp_2xx.......................: 83963 1114.158948/s
    resp_409_conflict..............: 553   7.338112/s
    resp_error_coded...............: 553   7.338112/s
    setup_requests.................: 100   1.326964/s

    HTTP
    http_req_duration..............: avg=2.67ms   min=160.04µs med=1.26ms   p(95)=5.21ms   p(99)=22.43ms  max=690.77ms
      { expected_response:true }...: avg=2.65ms   min=160.04µs med=1.26ms   p(95)=5.2ms    p(99)=22.25ms  max=690.77ms
      { phase:measure }............: avg=2.52ms   min=160.04µs med=1.22ms   p(95)=4.72ms   p(99)=19.95ms  max=690.77ms
    http_req_failed................: 0.65% 553 out of 84516
      { phase:measure }............: 0.68% 553 out of 81136
    http_reqs......................: 84516 1121.49706/s

    EXECUTION
    iteration_duration.............: avg=111.47ms min=101.84ms med=106.33ms p(95)=119.64ms p(99)=176.88ms max=869.57ms
    iterations.....................: 21104 280.042524/s
    vus............................: 50    min=0            max=50
    vus_max........................: 55    min=55           max=55

    NETWORK
    data_received..................: 87 MB 1.2 MB/s
    data_sent......................: 18 MB 237 kB/s



running (1m15.4s), 00/55 VUs, 21104 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s